In [1]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame

In [24]:
df1 = DataFrame({"城市":["北京","上海","广州"], "人口":[1000,1500,2000]})
df1

   城市    人口
0  北京  1000
1  上海  1500
2  广州  2000

In [25]:
df1['GDP'] = Series([10,20,15])
df1

   城市    人口  GDP
0  北京  1000   10
1  上海  1500   20
2  广州  2000   15

In [26]:
df1.drop(columns='GDP',inplace=True)
df1

   城市    人口
0  北京  1000
1  上海  1500
2  广州  2000

In [46]:
gdp_map = {"北京":10, "上海":20, "广州":15}

In [47]:
s1=df1['城市'].map(gdp_map)
print(s1,type(s1))

0    10
1    20
2    15
Name: 城市, dtype: int64 <class 'pandas.core.series.Series'>

In [48]:
df1['GDP'] = df1['城市'].map(dgp_map)
df1

   城市    人口  GDP
0  北京  1000   10
1  上海  1500   20
2  广州  2000   15

In [51]:
df2 = DataFrame({"城市":["北京","上海","广州"], "人口":[1000,1500,2000]},\
                index=['A','B','C'])
df2

   城市    人口
A  北京  1000
B  上海  1500
C  广州  2000

In [52]:
df2['GDP'] = Series([10,20,15]) # Series默认index为[0,1,2]，与df2.index不符
df2

   城市    人口  GDP
A  北京  1000  NaN
B  上海  1500  NaN
C  广州  2000  NaN

In [53]:
df2['GDP'] = Series([10,20,15],index=['A','B','C'])
df2

   城市    人口  GDP
A  北京  1000   10
B  上海  1500   20
C  广州  2000   15

# replace in series

In [54]:
s1 = Series(np.arange(10))
s1

0    0
1    1
2    2
3    3
4    4
5    5
6    6
7    7
8    8
9    9
dtype: int64

In [55]:
s1.replace(1, np.nan)

0    0.0
1    NaN
2    2.0
3    3.0
4    4.0
5    5.0
6    6.0
7    7.0
8    8.0
9    9.0
dtype: float64

In [57]:
s1.replace({1:np.nan})

0    0.0
1    NaN
2    2.0
3    3.0
4    4.0
5    5.0
6    6.0
7    7.0
8    8.0
9    9.0
dtype: float64

In [58]:
s1.replace([1,2,3],[10,20,30])

0     0
1    10
2    20
3    30
4     4
5     5
6     6
7     7
8     8
9     9
dtype: int64